HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN27 */
#define IFX_EBCU_ACCEN0_EN27_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN27 */
#define IFX_EBCU_ACCEN0_EN27_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN27 */
#define IFX_EBCU_ACCEN0_EN27_OFF (27)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN28 */
#define IFX_EBCU_ACCEN0_EN28_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN28 */
#define IFX_EBCU_ACCEN0_EN28_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN28 */
#define IFX_EBCU_ACCEN0_EN28_OFF (28)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN29 */
#define IFX_EBCU_ACCEN0_EN29_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN29 */
#define IFX_EBCU_ACCEN0_EN29_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN29 */
#define IFX_EBCU_ACCEN0_EN29_OFF (29)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN2 */
#define IFX_EBCU_ACCEN0_EN2_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN2 */
#define IFX_EBCU_ACCEN0_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN2 */
#define IFX_EBCU_ACCEN0_EN2_OFF (2)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN30 */
#define IFX_EBCU_ACCEN0_EN30_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN30 */
#define IFX_EBCU_ACCEN0_EN30_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN30 */
#define IFX_EBCU_ACCEN0_EN30_OFF (30)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN31 */
#define IFX_EBCU_ACCEN0_EN31_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN31 */
#define IFX_EBCU_ACCEN0_EN31_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN31 */
#define IFX_EBCU_ACCEN0_EN31_OFF (31)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN3 */
#define IFX_EBCU_ACCEN0_EN3_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN3 */
#define IFX_EBCU_ACCEN0_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN3 */
#define IFX_EBCU_ACCEN0_EN3_OFF (3)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN4 */
#define IFX_EBCU_ACCEN0_EN4_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN4 */
#define IFX_EBCU_ACCEN0_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN4 */
#define IFX_EBCU_ACCEN0_EN4_OFF (4)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN5 */
#define IFX_EBCU_ACCEN0_EN5_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN5 */
#define IFX_EBCU_ACCEN0_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN5 */
#define IFX_EBCU_ACCEN0_EN5_OFF (5)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN6 */
#define IFX_EBCU_ACCEN0_EN6_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN6 */
#define IFX_EBCU_ACCEN0_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN6 */
#define IFX_EBCU_ACCEN0_EN6_OFF (6)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN7 */
#define IFX_EBCU_ACCEN0_EN7_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN7 */
#define IFX_EBCU_ACCEN0_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN7 */
#define IFX_EBCU_ACCEN0_EN7_OFF (7)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN8 */
#define IFX_EBCU_ACCEN0_EN8_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN8 */
#define IFX_EBCU_ACCEN0_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN8 */
#define IFX_EBCU_ACCEN0_EN8_OFF (8)

/** \\brief  Length for Ifx_EBCU_ACCEN0_Bits.EN9 */
#define IFX_EBCU_ACCEN0_EN9_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN0_Bits.EN9 */
#define IFX_EBCU_ACCEN0_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN0_Bits.EN9 */
#define IFX_EBCU_ACCEN0_EN9_OFF (9)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN32 */
#define IFX_EBCU_ACCEN1_EN32_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN32 */
#define IFX_EBCU_ACCEN1_EN32_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN32 */
#define IFX_EBCU_ACCEN1_EN32_OFF (0)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN33 */
#define IFX_EBCU_ACCEN1_EN33_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN33 */
#define IFX_EBCU_ACCEN1_EN33_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN33 */
#define IFX_EBCU_ACCEN1_EN33_OFF (1)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN34 */
#define IFX_EBCU_ACCEN1_EN34_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN34 */
#define IFX_EBCU_ACCEN1_EN34_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN34 */
#define IFX_EBCU_ACCEN1_EN34_OFF (2)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN35 */
#define IFX_EBCU_ACCEN1_EN35_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN35 */
#define IFX_EBCU_ACCEN1_EN35_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN35 */
#define IFX_EBCU_ACCEN1_EN35_OFF (3)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN36 */
#define IFX_EBCU_ACCEN1_EN36_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN36 */
#define IFX_EBCU_ACCEN1_EN36_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN36 */
#define IFX_EBCU_ACCEN1_EN36_OFF (4)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN37 */
#define IFX_EBCU_ACCEN1_EN37_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN37 */
#define IFX_EBCU_ACCEN1_EN37_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN37 */
#define IFX_EBCU_ACCEN1_EN37_OFF (5)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN38 */
#define IFX_EBCU_ACCEN1_EN38_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN38 */
#define IFX_EBCU_ACCEN1_EN38_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN38 */
#define IFX_EBCU_ACCEN1_EN38_OFF (6)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN39 */
#define IFX_EBCU_ACCEN1_EN39_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN39 */
#define IFX_EBCU_ACCEN1_EN39_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN39 */
#define IFX_EBCU_ACCEN1_EN39_OFF (7)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN40 */
#define IFX_EBCU_ACCEN1_EN40_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN40 */
#define IFX_EBCU_ACCEN1_EN40_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN40 */
#define IFX_EBCU_ACCEN1_EN40_OFF (8)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN41 */
#define IFX_EBCU_ACCEN1_EN41_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN41 */
#define IFX_EBCU_ACCEN1_EN41_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN41 */
#define IFX_EBCU_ACCEN1_EN41_OFF (9)

