HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN42 */
#define IFX_EBCU_ACCEN1_EN42_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN42 */
#define IFX_EBCU_ACCEN1_EN42_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN42 */
#define IFX_EBCU_ACCEN1_EN42_OFF (10)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN43 */
#define IFX_EBCU_ACCEN1_EN43_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN43 */
#define IFX_EBCU_ACCEN1_EN43_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN43 */
#define IFX_EBCU_ACCEN1_EN43_OFF (11)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN44 */
#define IFX_EBCU_ACCEN1_EN44_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN44 */
#define IFX_EBCU_ACCEN1_EN44_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN44 */
#define IFX_EBCU_ACCEN1_EN44_OFF (12)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN45 */
#define IFX_EBCU_ACCEN1_EN45_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN45 */
#define IFX_EBCU_ACCEN1_EN45_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN45 */
#define IFX_EBCU_ACCEN1_EN45_OFF (13)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN46 */
#define IFX_EBCU_ACCEN1_EN46_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN46 */
#define IFX_EBCU_ACCEN1_EN46_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN46 */
#define IFX_EBCU_ACCEN1_EN46_OFF (14)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN47 */
#define IFX_EBCU_ACCEN1_EN47_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN47 */
#define IFX_EBCU_ACCEN1_EN47_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN47 */
#define IFX_EBCU_ACCEN1_EN47_OFF (15)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN48 */
#define IFX_EBCU_ACCEN1_EN48_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN48 */
#define IFX_EBCU_ACCEN1_EN48_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN48 */
#define IFX_EBCU_ACCEN1_EN48_OFF (16)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN49 */
#define IFX_EBCU_ACCEN1_EN49_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN49 */
#define IFX_EBCU_ACCEN1_EN49_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN49 */
#define IFX_EBCU_ACCEN1_EN49_OFF (17)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN50 */
#define IFX_EBCU_ACCEN1_EN50_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN50 */
#define IFX_EBCU_ACCEN1_EN50_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN50 */
#define IFX_EBCU_ACCEN1_EN50_OFF (18)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN51 */
#define IFX_EBCU_ACCEN1_EN51_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN51 */
#define IFX_EBCU_ACCEN1_EN51_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN51 */
#define IFX_EBCU_ACCEN1_EN51_OFF (19)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN52 */
#define IFX_EBCU_ACCEN1_EN52_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN52 */
#define IFX_EBCU_ACCEN1_EN52_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN52 */
#define IFX_EBCU_ACCEN1_EN52_OFF (20)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN53 */
#define IFX_EBCU_ACCEN1_EN53_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN53 */
#define IFX_EBCU_ACCEN1_EN53_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN53 */
#define IFX_EBCU_ACCEN1_EN53_OFF (21)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN54 */
#define IFX_EBCU_ACCEN1_EN54_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN54 */
#define IFX_EBCU_ACCEN1_EN54_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN54 */
#define IFX_EBCU_ACCEN1_EN54_OFF (22)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN55 */
#define IFX_EBCU_ACCEN1_EN55_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN55 */
#define IFX_EBCU_ACCEN1_EN55_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN55 */
#define IFX_EBCU_ACCEN1_EN55_OFF (23)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN56 */
#define IFX_EBCU_ACCEN1_EN56_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN56 */
#define IFX_EBCU_ACCEN1_EN56_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN56 */
#define IFX_EBCU_ACCEN1_EN56_OFF (24)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN57 */
#define IFX_EBCU_ACCEN1_EN57_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN57 */
#define IFX_EBCU_ACCEN1_EN57_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN57 */
#define IFX_EBCU_ACCEN1_EN57_OFF (25)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN58 */
#define IFX_EBCU_ACCEN1_EN58_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN58 */
#define IFX_EBCU_ACCEN1_EN58_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN58 */
#define IFX_EBCU_ACCEN1_EN58_OFF (26)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN59 */
#define IFX_EBCU_ACCEN1_EN59_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN59 */
#define IFX_EBCU_ACCEN1_EN59_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN59 */
#define IFX_EBCU_ACCEN1_EN59_OFF (27)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN60 */
#define IFX_EBCU_ACCEN1_EN60_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN60 */
#define IFX_EBCU_ACCEN1_EN60_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN60 */
#define IFX_EBCU_ACCEN1_EN60_OFF (28)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN61 */
#define IFX_EBCU_ACCEN1_EN61_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN61 */
#define IFX_EBCU_ACCEN1_EN61_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN61 */
#define IFX_EBCU_ACCEN1_EN61_OFF (29)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN62 */
#define IFX_EBCU_ACCEN1_EN62_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN62 */
#define IFX_EBCU_ACCEN1_EN62_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN62 */
#define IFX_EBCU_ACCEN1_EN62_OFF (30)

/** \\brief  Length for Ifx_EBCU_ACCEN1_Bits.EN63 */
#define IFX_EBCU_ACCEN1_EN63_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ACCEN1_Bits.EN63 */
#define IFX_EBCU_ACCEN1_EN63_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ACCEN1_Bits.EN63 */
#define IFX_EBCU_ACCEN1_EN63_OFF (31)

/** \\brief  Length for Ifx_EBCU_CON_Bits.DBG */
#define IFX_EBCU_CON_DBG_LEN (1)

/** \\brief  Mask for Ifx_EBCU_CON_Bits.DBG */
#define IFX_EBCU_CON_DBG_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_CON_Bits.DBG */
#define IFX_EBCU_CON_DBG_OFF (16)

/** \\brief  Length for Ifx_EBCU_CON_Bits.SPC */
#define IFX_EBCU_CON_SPC_LEN (8)

