HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Mask for Ifx_EBCU_CON_Bits.SPC */
#define IFX_EBCU_CON_SPC_MSK (0xff)

/** \\brief  Offset for Ifx_EBCU_CON_Bits.SPC */
#define IFX_EBCU_CON_SPC_OFF (24)

/** \\brief  Length for Ifx_EBCU_CON_Bits.TOUT */
#define IFX_EBCU_CON_TOUT_LEN (16)

/** \\brief  Mask for Ifx_EBCU_CON_Bits.TOUT */
#define IFX_EBCU_CON_TOUT_MSK (0xffff)

/** \\brief  Offset for Ifx_EBCU_CON_Bits.TOUT */
#define IFX_EBCU_CON_TOUT_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBADR1_Bits.ADR1 */
#define IFX_EBCU_DBADR1_ADR1_LEN (32)

/** \\brief  Mask for Ifx_EBCU_DBADR1_Bits.ADR1 */
#define IFX_EBCU_DBADR1_ADR1_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBCU_DBADR1_Bits.ADR1 */
#define IFX_EBCU_DBADR1_ADR1_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBADR2_Bits.ADR2 */
#define IFX_EBCU_DBADR2_ADR2_LEN (32)

/** \\brief  Mask for Ifx_EBCU_DBADR2_Bits.ADR2 */
#define IFX_EBCU_DBADR2_ADR2_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBCU_DBADR2_Bits.ADR2 */
#define IFX_EBCU_DBADR2_ADR2_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBADRT_Bits.FPIADR */
#define IFX_EBCU_DBADRT_FPIADR_LEN (32)

/** \\brief  Mask for Ifx_EBCU_DBADRT_Bits.FPIADR */
#define IFX_EBCU_DBADRT_FPIADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBCU_DBADRT_Bits.FPIADR */
#define IFX_EBCU_DBADRT_FPIADR_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBBOS_Bits.OPC */
#define IFX_EBCU_DBBOS_OPC_LEN (4)

/** \\brief  Mask for Ifx_EBCU_DBBOS_Bits.OPC */
#define IFX_EBCU_DBBOS_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_DBBOS_Bits.OPC */
#define IFX_EBCU_DBBOS_OPC_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBBOS_Bits.RD */
#define IFX_EBCU_DBBOS_RD_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOS_Bits.RD */
#define IFX_EBCU_DBBOS_RD_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOS_Bits.RD */
#define IFX_EBCU_DBBOS_RD_OFF (12)

/** \\brief  Length for Ifx_EBCU_DBBOS_Bits.SVM */
#define IFX_EBCU_DBBOS_SVM_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOS_Bits.SVM */
#define IFX_EBCU_DBBOS_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOS_Bits.SVM */
#define IFX_EBCU_DBBOS_SVM_OFF (4)

/** \\brief  Length for Ifx_EBCU_DBBOS_Bits.WR */
#define IFX_EBCU_DBBOS_WR_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOS_Bits.WR */
#define IFX_EBCU_DBBOS_WR_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOS_Bits.WR */
#define IFX_EBCU_DBBOS_WR_OFF (8)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIABORT */
#define IFX_EBCU_DBBOST_FPIABORT_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIABORT */
#define IFX_EBCU_DBBOST_FPIABORT_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIABORT */
#define IFX_EBCU_DBBOST_FPIABORT_OFF (13)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIACK */
#define IFX_EBCU_DBBOST_FPIACK_LEN (2)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIACK */
#define IFX_EBCU_DBBOST_FPIACK_MSK (0x3)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIACK */
#define IFX_EBCU_DBBOST_FPIACK_OFF (5)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIOPC */
#define IFX_EBCU_DBBOST_FPIOPC_LEN (4)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIOPC */
#define IFX_EBCU_DBBOST_FPIOPC_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIOPC */
#define IFX_EBCU_DBBOST_FPIOPC_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIOPS */
#define IFX_EBCU_DBBOST_FPIOPS_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIOPS */
#define IFX_EBCU_DBBOST_FPIOPS_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIOPS */
#define IFX_EBCU_DBBOST_FPIOPS_OFF (11)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIRD */
#define IFX_EBCU_DBBOST_FPIRD_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIRD */
#define IFX_EBCU_DBBOST_FPIRD_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIRD */
#define IFX_EBCU_DBBOST_FPIRD_OFF (12)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIRDY */
#define IFX_EBCU_DBBOST_FPIRDY_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIRDY */
#define IFX_EBCU_DBBOST_FPIRDY_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIRDY */
#define IFX_EBCU_DBBOST_FPIRDY_OFF (7)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIRST */
#define IFX_EBCU_DBBOST_FPIRST_LEN (2)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIRST */
#define IFX_EBCU_DBBOST_FPIRST_MSK (0x3)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIRST */
#define IFX_EBCU_DBBOST_FPIRST_OFF (9)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPISVM */
#define IFX_EBCU_DBBOST_FPISVM_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPISVM */
#define IFX_EBCU_DBBOST_FPISVM_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPISVM */
#define IFX_EBCU_DBBOST_FPISVM_OFF (4)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPITAG */
#define IFX_EBCU_DBBOST_FPITAG_LEN (6)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPITAG */
#define IFX_EBCU_DBBOST_FPITAG_MSK (0x3f)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPITAG */
#define IFX_EBCU_DBBOST_FPITAG_OFF (16)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPITOUT */
#define IFX_EBCU_DBBOST_FPITOUT_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPITOUT */
#define IFX_EBCU_DBBOST_FPITOUT_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPITOUT */
#define IFX_EBCU_DBBOST_FPITOUT_OFF (14)

/** \\brief  Length for Ifx_EBCU_DBBOST_Bits.FPIWR */
#define IFX_EBCU_DBBOST_FPIWR_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBBOST_Bits.FPIWR */
#define IFX_EBCU_DBBOST_FPIWR_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBBOST_Bits.FPIWR */
#define IFX_EBCU_DBBOST_FPIWR_OFF (8)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.CONCOM0 */
#define IFX_EBCU_DBCNTL_CONCOM0_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.CONCOM0 */
#define IFX_EBCU_DBCNTL_CONCOM0_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.CONCOM0 */
#define IFX_EBCU_DBCNTL_CONCOM0_OFF (12)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.CONCOM1 */
#define IFX_EBCU_DBCNTL_CONCOM1_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.CONCOM1 */
#define IFX_EBCU_DBCNTL_CONCOM1_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.CONCOM1 */
#define IFX_EBCU_DBCNTL_CONCOM1_OFF (13)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.CONCOM2 */
#define IFX_EBCU_DBCNTL_CONCOM2_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.CONCOM2 */
#define IFX_EBCU_DBCNTL_CONCOM2_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.CONCOM2 */
#define IFX_EBCU_DBCNTL_CONCOM2_OFF (14)

