HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.EO */
#define IFX_EBCU_DBCNTL_EO_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.EO */
#define IFX_EBCU_DBCNTL_EO_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.EO */
#define IFX_EBCU_DBCNTL_EO_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.OA */
#define IFX_EBCU_DBCNTL_OA_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.OA */
#define IFX_EBCU_DBCNTL_OA_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.OA */
#define IFX_EBCU_DBCNTL_OA_OFF (1)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONA1 */
#define IFX_EBCU_DBCNTL_ONA1_LEN (2)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONA1 */
#define IFX_EBCU_DBCNTL_ONA1_MSK (0x3)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONA1 */
#define IFX_EBCU_DBCNTL_ONA1_OFF (20)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONA2 */
#define IFX_EBCU_DBCNTL_ONA2_LEN (2)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONA2 */
#define IFX_EBCU_DBCNTL_ONA2_MSK (0x3)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONA2 */
#define IFX_EBCU_DBCNTL_ONA2_OFF (24)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONBOS0 */
#define IFX_EBCU_DBCNTL_ONBOS0_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS0 */
#define IFX_EBCU_DBCNTL_ONBOS0_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS0 */
#define IFX_EBCU_DBCNTL_ONBOS0_OFF (28)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_EBCU_DBCNTL_ONBOS1_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_EBCU_DBCNTL_ONBOS1_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS1 */
#define IFX_EBCU_DBCNTL_ONBOS1_OFF (29)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_EBCU_DBCNTL_ONBOS2_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_EBCU_DBCNTL_ONBOS2_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS2 */
#define IFX_EBCU_DBCNTL_ONBOS2_OFF (30)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_EBCU_DBCNTL_ONBOS3_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_EBCU_DBCNTL_ONBOS3_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_EBCU_DBCNTL_ONBOS3_OFF (31)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.ONG */
#define IFX_EBCU_DBCNTL_ONG_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.ONG */
#define IFX_EBCU_DBCNTL_ONG_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.ONG */
#define IFX_EBCU_DBCNTL_ONG_OFF (16)

/** \\brief  Length for Ifx_EBCU_DBCNTL_Bits.RA */
#define IFX_EBCU_DBCNTL_RA_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBCNTL_Bits.RA */
#define IFX_EBCU_DBCNTL_RA_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBCNTL_Bits.RA */
#define IFX_EBCU_DBCNTL_RA_OFF (4)

/** \\brief  Length for Ifx_EBCU_DBDAT_Bits.FPIDATA */
#define IFX_EBCU_DBDAT_FPIDATA_LEN (32)

/** \\brief  Mask for Ifx_EBCU_DBDAT_Bits.FPIDATA */
#define IFX_EBCU_DBDAT_FPIDATA_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBCU_DBDAT_Bits.FPIDATA */
#define IFX_EBCU_DBDAT_FPIDATA_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT0 */
#define IFX_EBCU_DBGNTT_FPIGNT0_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT0 */
#define IFX_EBCU_DBGNTT_FPIGNT0_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT0 */
#define IFX_EBCU_DBGNTT_FPIGNT0_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT10 */
#define IFX_EBCU_DBGNTT_FPIGNT10_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT10 */
#define IFX_EBCU_DBGNTT_FPIGNT10_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT10 */
#define IFX_EBCU_DBGNTT_FPIGNT10_OFF (10)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT11 */
#define IFX_EBCU_DBGNTT_FPIGNT11_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT11 */
#define IFX_EBCU_DBGNTT_FPIGNT11_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT11 */
#define IFX_EBCU_DBGNTT_FPIGNT11_OFF (11)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT12 */
#define IFX_EBCU_DBGNTT_FPIGNT12_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT12 */
#define IFX_EBCU_DBGNTT_FPIGNT12_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT12 */
#define IFX_EBCU_DBGNTT_FPIGNT12_OFF (12)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT13 */
#define IFX_EBCU_DBGNTT_FPIGNT13_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT13 */
#define IFX_EBCU_DBGNTT_FPIGNT13_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT13 */
#define IFX_EBCU_DBGNTT_FPIGNT13_OFF (13)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT14 */
#define IFX_EBCU_DBGNTT_FPIGNT14_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT14 */
#define IFX_EBCU_DBGNTT_FPIGNT14_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT14 */
#define IFX_EBCU_DBGNTT_FPIGNT14_OFF (14)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT15 */
#define IFX_EBCU_DBGNTT_FPIGNT15_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT15 */
#define IFX_EBCU_DBGNTT_FPIGNT15_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT15 */
#define IFX_EBCU_DBGNTT_FPIGNT15_OFF (15)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT1 */
#define IFX_EBCU_DBGNTT_FPIGNT1_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT1 */
#define IFX_EBCU_DBGNTT_FPIGNT1_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT1 */
#define IFX_EBCU_DBGNTT_FPIGNT1_OFF (1)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT2 */
#define IFX_EBCU_DBGNTT_FPIGNT2_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT2 */
#define IFX_EBCU_DBGNTT_FPIGNT2_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT2 */
#define IFX_EBCU_DBGNTT_FPIGNT2_OFF (2)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT3 */
#define IFX_EBCU_DBGNTT_FPIGNT3_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT3 */
#define IFX_EBCU_DBGNTT_FPIGNT3_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT3 */
#define IFX_EBCU_DBGNTT_FPIGNT3_OFF (3)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT4 */
#define IFX_EBCU_DBGNTT_FPIGNT4_LEN (1)

