HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT4 */
#define IFX_EBCU_DBGNTT_FPIGNT4_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT4 */
#define IFX_EBCU_DBGNTT_FPIGNT4_OFF (4)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT5 */
#define IFX_EBCU_DBGNTT_FPIGNT5_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT5 */
#define IFX_EBCU_DBGNTT_FPIGNT5_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT5 */
#define IFX_EBCU_DBGNTT_FPIGNT5_OFF (5)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT6 */
#define IFX_EBCU_DBGNTT_FPIGNT6_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT6 */
#define IFX_EBCU_DBGNTT_FPIGNT6_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT6 */
#define IFX_EBCU_DBGNTT_FPIGNT6_OFF (6)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT7 */
#define IFX_EBCU_DBGNTT_FPIGNT7_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT7 */
#define IFX_EBCU_DBGNTT_FPIGNT7_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT7 */
#define IFX_EBCU_DBGNTT_FPIGNT7_OFF (7)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT8 */
#define IFX_EBCU_DBGNTT_FPIGNT8_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT8 */
#define IFX_EBCU_DBGNTT_FPIGNT8_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT8 */
#define IFX_EBCU_DBGNTT_FPIGNT8_OFF (8)

/** \\brief  Length for Ifx_EBCU_DBGNTT_Bits.FPIGNT9 */
#define IFX_EBCU_DBGNTT_FPIGNT9_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGNTT_Bits.FPIGNT9 */
#define IFX_EBCU_DBGNTT_FPIGNT9_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGNTT_Bits.FPIGNT9 */
#define IFX_EBCU_DBGNTT_FPIGNT9_OFF (9)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT0 */
#define IFX_EBCU_DBGRNT_FPIGNT0_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT0 */
#define IFX_EBCU_DBGRNT_FPIGNT0_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT0 */
#define IFX_EBCU_DBGRNT_FPIGNT0_OFF (0)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT10 */
#define IFX_EBCU_DBGRNT_FPIGNT10_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT10 */
#define IFX_EBCU_DBGRNT_FPIGNT10_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT10 */
#define IFX_EBCU_DBGRNT_FPIGNT10_OFF (10)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT11 */
#define IFX_EBCU_DBGRNT_FPIGNT11_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT11 */
#define IFX_EBCU_DBGRNT_FPIGNT11_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT11 */
#define IFX_EBCU_DBGRNT_FPIGNT11_OFF (11)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT12 */
#define IFX_EBCU_DBGRNT_FPIGNT12_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT12 */
#define IFX_EBCU_DBGRNT_FPIGNT12_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT12 */
#define IFX_EBCU_DBGRNT_FPIGNT12_OFF (12)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT13 */
#define IFX_EBCU_DBGRNT_FPIGNT13_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT13 */
#define IFX_EBCU_DBGRNT_FPIGNT13_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT13 */
#define IFX_EBCU_DBGRNT_FPIGNT13_OFF (13)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT14 */
#define IFX_EBCU_DBGRNT_FPIGNT14_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT14 */
#define IFX_EBCU_DBGRNT_FPIGNT14_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT14 */
#define IFX_EBCU_DBGRNT_FPIGNT14_OFF (14)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT15 */
#define IFX_EBCU_DBGRNT_FPIGNT15_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT15 */
#define IFX_EBCU_DBGRNT_FPIGNT15_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT15 */
#define IFX_EBCU_DBGRNT_FPIGNT15_OFF (15)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT1 */
#define IFX_EBCU_DBGRNT_FPIGNT1_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT1 */
#define IFX_EBCU_DBGRNT_FPIGNT1_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT1 */
#define IFX_EBCU_DBGRNT_FPIGNT1_OFF (1)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT2 */
#define IFX_EBCU_DBGRNT_FPIGNT2_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT2 */
#define IFX_EBCU_DBGRNT_FPIGNT2_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT2 */
#define IFX_EBCU_DBGRNT_FPIGNT2_OFF (2)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT3 */
#define IFX_EBCU_DBGRNT_FPIGNT3_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT3 */
#define IFX_EBCU_DBGRNT_FPIGNT3_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT3 */
#define IFX_EBCU_DBGRNT_FPIGNT3_OFF (3)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT4 */
#define IFX_EBCU_DBGRNT_FPIGNT4_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT4 */
#define IFX_EBCU_DBGRNT_FPIGNT4_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT4 */
#define IFX_EBCU_DBGRNT_FPIGNT4_OFF (4)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT5 */
#define IFX_EBCU_DBGRNT_FPIGNT5_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT5 */
#define IFX_EBCU_DBGRNT_FPIGNT5_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT5 */
#define IFX_EBCU_DBGRNT_FPIGNT5_OFF (5)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT6 */
#define IFX_EBCU_DBGRNT_FPIGNT6_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT6 */
#define IFX_EBCU_DBGRNT_FPIGNT6_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT6 */
#define IFX_EBCU_DBGRNT_FPIGNT6_OFF (6)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT7 */
#define IFX_EBCU_DBGRNT_FPIGNT7_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT7 */
#define IFX_EBCU_DBGRNT_FPIGNT7_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT7 */
#define IFX_EBCU_DBGRNT_FPIGNT7_OFF (7)

/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT8 */
#define IFX_EBCU_DBGRNT_FPIGNT8_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT8 */
#define IFX_EBCU_DBGRNT_FPIGNT8_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT8 */
#define IFX_EBCU_DBGRNT_FPIGNT8_OFF (8)

