HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Length for Ifx_EBCU_DBGRNT_Bits.FPIGNT9 */
#define IFX_EBCU_DBGRNT_FPIGNT9_LEN (1)

/** \\brief  Mask for Ifx_EBCU_DBGRNT_Bits.FPIGNT9 */
#define IFX_EBCU_DBGRNT_FPIGNT9_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_DBGRNT_Bits.FPIGNT9 */
#define IFX_EBCU_DBGRNT_FPIGNT9_OFF (9)

/** \\brief  Length for Ifx_EBCU_EADD_Bits.FPIADR */
#define IFX_EBCU_EADD_FPIADR_LEN (32)

/** \\brief  Mask for Ifx_EBCU_EADD_Bits.FPIADR */
#define IFX_EBCU_EADD_FPIADR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBCU_EADD_Bits.FPIADR */
#define IFX_EBCU_EADD_FPIADR_OFF (0)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.ABT */
#define IFX_EBCU_ECON_ABT_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.ABT */
#define IFX_EBCU_ECON_ABT_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.ABT */
#define IFX_EBCU_ECON_ABT_OFF (16)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.ACK */
#define IFX_EBCU_ECON_ACK_LEN (2)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.ACK */
#define IFX_EBCU_ECON_ACK_MSK (0x3)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.ACK */
#define IFX_EBCU_ECON_ACK_OFF (17)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.ERRCNT */
#define IFX_EBCU_ECON_ERRCNT_LEN (14)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.ERRCNT */
#define IFX_EBCU_ECON_ERRCNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.ERRCNT */
#define IFX_EBCU_ECON_ERRCNT_OFF (0)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_LEN (4)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.OPC */
#define IFX_EBCU_ECON_OPC_OFF (28)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.RDN */
#define IFX_EBCU_ECON_RDN_OFF (21)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.RDY */
#define IFX_EBCU_ECON_RDY_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.RDY */
#define IFX_EBCU_ECON_RDY_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.RDY */
#define IFX_EBCU_ECON_RDY_OFF (15)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.SVM */
#define IFX_EBCU_ECON_SVM_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.SVM */
#define IFX_EBCU_ECON_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.SVM */
#define IFX_EBCU_ECON_SVM_OFF (19)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_LEN (6)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_MSK (0x3f)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.TAG */
#define IFX_EBCU_ECON_TAG_OFF (22)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.TOUT */
#define IFX_EBCU_ECON_TOUT_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.TOUT */
#define IFX_EBCU_ECON_TOUT_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.TOUT */
#define IFX_EBCU_ECON_TOUT_OFF (14)

/** \\brief  Length for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_LEN (1)

/** \\brief  Mask for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_MSK (0x1)

/** \\brief  Offset for Ifx_EBCU_ECON_Bits.WRN */
#define IFX_EBCU_ECON_WRN_OFF (20)

/** \\brief  Length for Ifx_EBCU_EDAT_Bits.FPIDAT */
#define IFX_EBCU_EDAT_FPIDAT_LEN (32)

/** \\brief  Mask for Ifx_EBCU_EDAT_Bits.FPIDAT */
#define IFX_EBCU_EDAT_FPIDAT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_EBCU_EDAT_Bits.FPIDAT */
#define IFX_EBCU_EDAT_FPIDAT_OFF (0)

/** \\brief  Length for Ifx_EBCU_ID_Bits.MODNUMBER */
#define IFX_EBCU_ID_MODNUMBER_LEN (8)

/** \\brief  Mask for Ifx_EBCU_ID_Bits.MODNUMBER */
#define IFX_EBCU_ID_MODNUMBER_MSK (0xff)

/** \\brief  Offset for Ifx_EBCU_ID_Bits.MODNUMBER */
#define IFX_EBCU_ID_MODNUMBER_OFF (8)

/** \\brief  Length for Ifx_EBCU_ID_Bits.MODREV */
#define IFX_EBCU_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_EBCU_ID_Bits.MODREV */
#define IFX_EBCU_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_EBCU_ID_Bits.MODREV */
#define IFX_EBCU_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER10 */
#define IFX_EBCU_PRIOH_MASTER10_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER10 */
#define IFX_EBCU_PRIOH_MASTER10_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER10 */
#define IFX_EBCU_PRIOH_MASTER10_OFF (8)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER11 */
#define IFX_EBCU_PRIOH_MASTER11_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER11 */
#define IFX_EBCU_PRIOH_MASTER11_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER11 */
#define IFX_EBCU_PRIOH_MASTER11_OFF (12)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER12 */
#define IFX_EBCU_PRIOH_MASTER12_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER12 */
#define IFX_EBCU_PRIOH_MASTER12_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER12 */
#define IFX_EBCU_PRIOH_MASTER12_OFF (16)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER13 */
#define IFX_EBCU_PRIOH_MASTER13_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER13 */
#define IFX_EBCU_PRIOH_MASTER13_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER13 */
#define IFX_EBCU_PRIOH_MASTER13_OFF (20)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER14 */
#define IFX_EBCU_PRIOH_MASTER14_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER14 */
#define IFX_EBCU_PRIOH_MASTER14_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER14 */
#define IFX_EBCU_PRIOH_MASTER14_OFF (24)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER15 */
#define IFX_EBCU_PRIOH_MASTER15_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER15 */
#define IFX_EBCU_PRIOH_MASTER15_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER15 */
#define IFX_EBCU_PRIOH_MASTER15_OFF (28)

/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER8 */
#define IFX_EBCU_PRIOH_MASTER8_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER8 */
#define IFX_EBCU_PRIOH_MASTER8_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER8 */
#define IFX_EBCU_PRIOH_MASTER8_OFF (0)

