HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEbcu_bf.h
/** \\brief  Length for Ifx_EBCU_PRIOH_Bits.MASTER9 */
#define IFX_EBCU_PRIOH_MASTER9_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOH_Bits.MASTER9 */
#define IFX_EBCU_PRIOH_MASTER9_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOH_Bits.MASTER9 */
#define IFX_EBCU_PRIOH_MASTER9_OFF (4)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER0 */
#define IFX_EBCU_PRIOL_MASTER0_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER0 */
#define IFX_EBCU_PRIOL_MASTER0_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER0 */
#define IFX_EBCU_PRIOL_MASTER0_OFF (0)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER1 */
#define IFX_EBCU_PRIOL_MASTER1_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER1 */
#define IFX_EBCU_PRIOL_MASTER1_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER1 */
#define IFX_EBCU_PRIOL_MASTER1_OFF (4)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER2 */
#define IFX_EBCU_PRIOL_MASTER2_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER2 */
#define IFX_EBCU_PRIOL_MASTER2_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER2 */
#define IFX_EBCU_PRIOL_MASTER2_OFF (8)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER3 */
#define IFX_EBCU_PRIOL_MASTER3_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER3 */
#define IFX_EBCU_PRIOL_MASTER3_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER3 */
#define IFX_EBCU_PRIOL_MASTER3_OFF (12)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER4 */
#define IFX_EBCU_PRIOL_MASTER4_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER4 */
#define IFX_EBCU_PRIOL_MASTER4_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER4 */
#define IFX_EBCU_PRIOL_MASTER4_OFF (16)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER5 */
#define IFX_EBCU_PRIOL_MASTER5_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER5 */
#define IFX_EBCU_PRIOL_MASTER5_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER5 */
#define IFX_EBCU_PRIOL_MASTER5_OFF (20)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER6 */
#define IFX_EBCU_PRIOL_MASTER6_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER6 */
#define IFX_EBCU_PRIOL_MASTER6_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER6 */
#define IFX_EBCU_PRIOL_MASTER6_OFF (24)

/** \\brief  Length for Ifx_EBCU_PRIOL_Bits.MASTER7 */
#define IFX_EBCU_PRIOL_MASTER7_LEN (4)

/** \\brief  Mask for Ifx_EBCU_PRIOL_Bits.MASTER7 */
#define IFX_EBCU_PRIOL_MASTER7_MSK (0xf)

/** \\brief  Offset for Ifx_EBCU_PRIOL_Bits.MASTER7 */
#define IFX_EBCU_PRIOL_MASTER7_OFF (28)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEBCU_BF_H */
